package Algorithm.sort.tryWrite;

/**
 * @author Lucas
 * @date 2019-08-11 12:20
 * 将5 3 5 2 8 进行排序，创建一个大小为11的数组a[0]~a[10]
 * a[0]~a[10]中的数值其实就是 0 分到 10 分每个分数出现的次数。接下来，我们只需要将出现过的分数打印出来就可以了，出现几次就打印几次
 * a[0]为 0，表示“0”没有出现过，不打印。
 * a[1]为 0，表示“1”没有出现过，不打印。
 * a[2]为 1，表示“2”出现过 1 次，打印 2。
 * a[3]为 1，表示“3”出现过 1 次，打印 3。
 * a[4]为 0，表示“4”没有出现过，不打印。
 * a[5]为 2，表示“5”出现过 2 次，打印5 5。
 * a[6]为 0，表示“6”没有出现过，不打印。
 * a[7]为 0，表示“7”没有出现过，不打印。
 * a[8]为 1，表示“8”出现过 1 次，打印 8。
 * a[9]为 0，表示“9”没有出现过，不打印。
 * a[10]为 0，表示“10”没有出现过，不打印。
 */
public class BucketSort {
}
